Revit 2027 API
DesignToFabricationConverter Constructor
 Creates a new instance of the DesignToFabricationConverter class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DesignToFabricationConverter(
	Document document
)
Public Sub New (
	document As Document
)
public:
DesignToFabricationConverter(
	Document^ document
)
new :
        document : Document -> DesignToFabricationConverter
Parameters
document Document
 A document in which to convert MEP design elements into fabrication parts.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace